src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КЛ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КЛ_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КЛ_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/HTTPServices/Mobile/Module.bsl
#Область ОбработчикиСобытий
Функция ПроверитьДоступность(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Ок");
	Возврат Ответ;
КонецФункции

Функция ПолучитьДанные(Запрос)
	
	Попытка
	
		ИдентификаторУстройства = Запрос.Заголовки.Получить("X-MobileID");
		
		Узел = ПланыОбмена.ОбменСМобильным.НайтиПоКоду(ИдентификаторУстройства);
		
		Если НЕ ЗначениеЗаполнено(Узел) Тогда
			УзелОбъект = ПланыОбмена.ОбменСМобильным.СоздатьУзел();
			УзелОбъект.Наименование = ИдентификаторУстройства;
			УзелОбъект.Код = ИдентификаторУстройства;
			УзелОбъект.Пользователь = Пользователи.ТекущийПользователь();
			УзелОбъект.Записать();
			Узел = УзелОбъект.Ссылка;
			НачальнаяРегистрация(Узел);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказПокупателяИзменения.Ссылка КАК Ссылка,
		               |	ЗаказПокупателяИзменения.Ссылка.Номер КАК Номер,
		               |	ЗаказПокупателяИзменения.Ссылка.Дата КАК Дата,
		               |	ЗаказПокупателяИзменения.Ссылка.Комментарий КАК Комментарий,
		               |	ЗаказПокупателяИзменения.Ссылка.СуммаДокумента КАК СуммаДокумента
		               |ИЗ
		               |	Документ.ЗаказПокупателя.Изменения КАК ЗаказПокупателяИзменения
		               |ГДЕ
		               |	ЗаказПокупателяИзменения.Узел = &Узел";
		Запрос.УстановитьПараметр("Узел", Узел);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДанныеДляОтправки = Новый Массив;
		ОтправленныеОбъекты = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			ДанныеДокумента = Новый Структура;
			ДанныеДокумента.Вставить("Идентификатор", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			ДанныеДокумента.Вставить("Номер", Выборка.Номер);
			ДанныеДокумента.Вставить("Дата", ЗаписатьДатуJSON(Выборка.Дата, ФорматДатыJSON.ISO));
			ДанныеДокумента.Вставить("Комментарий", Выборка.Комментарий);
			ДанныеДокумента.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
			
			ДанныеДляОтправки.Добавить(ДанныеДокумента);
			
			ОтправленныеОбъекты.Добавить(Выборка.Ссылка);
			
		КонецЦикла;
		
		ТелоОтвета = ЗаписатьЗначениеJSON(ДанныеДляОтправки);
		
		Если ЗначениеЗаполнено(ОтправленныеОбъекты) Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, ОтправленныеОбъекты);
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("ОбменСМобильным.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Возврат Ответ;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура НачальнаяРегистрация(Узел)
	//Получаем данные по всем документам пользователя
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ответственный = &Ответственный";
	Запрос.УстановитьПараметр("Ответственный", Пользователи.ТекущийПользователь());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеДляРегистрации = Новый Массив;
	//Добавляем результат выборки в массив
	Пока Выборка.Следующий() Цикл
		ДанныеДляРегистрации.Добавить(Выборка.Ссылка);
	КонецЦикла;
	//Если массив не пустой регистрируем все к обмену
	Если ЗначениеЗаполнено(ДанныеДляРегистрации) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, ДанныеДляРегистрации);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеПоЗаказам(Пользователь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ЗаказПокупателя.Ссылка) КАК Количество
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("Ответственный", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.Количество;
	
КонецФункции
#КонецОбласти
